; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	image3 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(supports instrument1 image3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph1)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument6 thermograph0)
	(supports instrument6 image3)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(have_image Star10 spectrograph2)
	(have_image Star11 thermograph0)
	(have_image Planet12 image3)
	(have_image Planet13 image3)
	(have_image Planet14 spectrograph2)
	(have_image Phenomenon15 spectrograph1)
	(have_image Phenomenon16 image3)
	(have_image Star17 thermograph0)
))

)

; plan
1. (turn_to satellite2 star3 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star3)
   goals met: 0 of 8
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 8
3. (calibrate satellite2 instrument6 star3)
   added: (calibrated instrument6)
   goals met: 0 of 8
4. (turn_to satellite2 planet12 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet12)
   goals met: 0 of 8
5. (take_image satellite2 planet12 instrument6 image3)
   added: (have_image planet12 image3)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon16 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon16)
   goals met: 1 of 8
7. (take_image satellite2 phenomenon16 instrument6 image3)
   added: (have_image phenomenon16 image3)
   goals met: 2 of 8
8. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 8
9. (take_image satellite2 phenomenon15 instrument6 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 3 of 8
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 8
11. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 3 of 8
12. (turn_to satellite1 planet14 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet14)
   goals met: 3 of 8
13. (take_image satellite1 planet14 instrument3 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 4 of 8
14. (turn_to satellite1 star10 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star10)
   goals met: 4 of 8
15. (take_image satellite1 star10 instrument3 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 5 of 8
16. (turn_to satellite2 planet13 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 planet13)
   goals met: 5 of 8
17. (take_image satellite2 planet13 instrument6 image3)
   added: (have_image planet13 image3)
   goals met: 6 of 8
18. (turn_to satellite2 star11 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star11)
   goals met: 6 of 8
19. (take_image satellite2 star11 instrument6 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 7 of 8
20. (turn_to satellite2 star17 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star17)
   goals met: 7 of 8
21. (take_image satellite2 star17 instrument6 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 8 of 8
